app/Http/Controllers/Auth/LoginController.php

select * from `users` where `users`.`deleted_at` is null limit 1
---
    public function logout(Request $request)
    {
        User::find(Auth::id())->update(array('remember_token' => null));